R3dLion/arduino-esp8266/boards.txt
#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.ESPModule=Module
menu.led=Builtin Led
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=Exceptions
menu.wipe=Erase Flash
menu.sdk=Espressif FW
menu.ssl=SSL Support

##############################################################
dstike.name=DSTIKE WiFi Duck (ESP8266)
dstike.build.board=ESP8266_NODEMCU
dstike.build.variant=dstike
dstike.upload.tool=esptool
dstike.upload.maximum_data_size=81920
dstike.upload.wait_for_upload_port=true
dstike.upload.erase_cmd=
dstike.serial.disableDTR=true
dstike.serial.disableRTS=true
dstike.build.mcu=esp8266
dstike.build.core=esp8266
dstike.build.spiffs_pagesize=256
dstike.build.debug_port=
dstike.build.debug_level=
dstike.menu.debug.disabled=Disabled
dstike.menu.debug.serial=Serial (115200, newline)
dstike.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200
dstike.build.protocol_flags=-DENABLE_I2C -DI2C_SDA=4 -DI2C_SCL=5
dstike.upload.resetmethod=--before default_reset --after hard_reset
dstike.build.flash_mode=dio
dstike.build.flash_flags=-DFLASHMODE_DIO
dstike.build.flash_freq=40
dstike.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
dstike.menu.eesz.4M2M.build.flash_size=4M
dstike.menu.eesz.4M2M.build.flash_size_bytes=0x400000
dstike.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
dstike.menu.eesz.4M2M.build.spiffs_pagesize=256
dstike.menu.eesz.4M2M.upload.maximum_size=1044464
dstike.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
dstike.menu.eesz.4M2M.build.spiffs_start=0x200000
dstike.menu.eesz.4M2M.build.spiffs_end=0x3FA000
dstike.menu.eesz.4M2M.build.spiffs_blocksize=8192
dstike.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
dstike.menu.eesz.4M3M.build.flash_size=4M
dstike.menu.eesz.4M3M.build.flash_size_bytes=0x400000
dstike.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
dstike.menu.eesz.4M3M.build.spiffs_pagesize=256
dstike.menu.eesz.4M3M.upload.maximum_size=1044464
dstike.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
dstike.menu.eesz.4M3M.build.spiffs_start=0x100000
dstike.menu.eesz.4M3M.build.spiffs_end=0x3FA000
dstike.menu.eesz.4M3M.build.spiffs_blocksize=8192
dstike.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
dstike.menu.eesz.4M1M.build.flash_size=4M
dstike.menu.eesz.4M1M.build.flash_size_bytes=0x400000
dstike.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
dstike.menu.eesz.4M1M.build.spiffs_pagesize=256
dstike.menu.eesz.4M1M.upload.maximum_size=1044464
dstike.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
dstike.menu.eesz.4M1M.build.spiffs_start=0x300000
dstike.menu.eesz.4M1M.build.spiffs_end=0x3FA000
dstike.menu.eesz.4M1M.build.spiffs_blocksize=8192
dstike.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
dstike.menu.eesz.4M.build.flash_size=4M
dstike.menu.eesz.4M.build.flash_size_bytes=0x400000
dstike.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
dstike.menu.eesz.4M.build.spiffs_pagesize=256
dstike.menu.eesz.4M.upload.maximum_size=1044464
dstike.menu.eesz.4M.build.rfcal_addr=0x3FC000
dstike.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
dstike.menu.eesz.2M64.build.flash_size=2M
dstike.menu.eesz.2M64.build.flash_size_bytes=0x200000
dstike.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
dstike.menu.eesz.2M64.build.spiffs_pagesize=256
dstike.menu.eesz.2M64.upload.maximum_size=1044464
dstike.menu.eesz.2M64.build.rfcal_addr=0x1FC000
dstike.menu.eesz.2M64.build.spiffs_start=0x1F0000
dstike.menu.eesz.2M64.build.spiffs_end=0x1FB000
dstike.menu.eesz.2M64.build.spiffs_blocksize=4096
dstike.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
dstike.menu.eesz.2M128.build.flash_size=2M
dstike.menu.eesz.2M128.build.flash_size_bytes=0x200000
dstike.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
dstike.menu.eesz.2M128.build.spiffs_pagesize=256
dstike.menu.eesz.2M128.upload.maximum_size=1044464
dstike.menu.eesz.2M128.build.rfcal_addr=0x1FC000
dstike.menu.eesz.2M128.build.spiffs_start=0x1E0000
dstike.menu.eesz.2M128.build.spiffs_end=0x1FB000
dstike.menu.eesz.2M128.build.spiffs_blocksize=4096
dstike.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
dstike.menu.eesz.2M256.build.flash_size=2M
dstike.menu.eesz.2M256.build.flash_size_bytes=0x200000
dstike.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
dstike.menu.eesz.2M256.build.spiffs_pagesize=256
dstike.menu.eesz.2M256.upload.maximum_size=1044464
dstike.menu.eesz.2M256.build.rfcal_addr=0x1FC000
dstike.menu.eesz.2M256.build.spiffs_start=0x1C0000
dstike.menu.eesz.2M256.build.spiffs_end=0x1FB000
dstike.menu.eesz.2M256.build.spiffs_blocksize=4096
dstike.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
dstike.menu.eesz.2M512.build.flash_size=2M
dstike.menu.eesz.2M512.build.flash_size_bytes=0x200000
dstike.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
dstike.menu.eesz.2M512.build.spiffs_pagesize=256
dstike.menu.eesz.2M512.upload.maximum_size=1044464
dstike.menu.eesz.2M512.build.rfcal_addr=0x1FC000
dstike.menu.eesz.2M512.build.spiffs_start=0x180000
dstike.menu.eesz.2M512.build.spiffs_end=0x1FA000
dstike.menu.eesz.2M512.build.spiffs_blocksize=8192
dstike.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
dstike.menu.eesz.2M1M.build.flash_size=2M
dstike.menu.eesz.2M1M.build.flash_size_bytes=0x200000
dstike.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
dstike.menu.eesz.2M1M.build.spiffs_pagesize=256
dstike.menu.eesz.2M1M.upload.maximum_size=1044464
dstike.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
dstike.menu.eesz.2M1M.build.spiffs_start=0x100000
dstike.menu.eesz.2M1M.build.spiffs_end=0x1FA000
dstike.menu.eesz.2M1M.build.spiffs_blocksize=8192
dstike.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
dstike.menu.eesz.2M.build.flash_size=2M
dstike.menu.eesz.2M.build.flash_size_bytes=0x200000
dstike.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
dstike.menu.eesz.2M.build.spiffs_pagesize=256
dstike.menu.eesz.2M.upload.maximum_size=1044464
dstike.menu.eesz.2M.build.rfcal_addr=0x1FC000
dstike.build.f_cpu=160000000L
dstike.build.vtable_flags=-DVTABLES_IN_FLASH
dstike.build.exception_flags=-fno-exceptions
dstike.build.sslflags=
dstike.build.debug_port=
dstike.build.lwip_include=lwip2/include
dstike.build.lwip_lib=-llwip2-536-feat
dstike.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
dstike.menu.wipe.none=Only Sketch
dstike.menu.wipe.none.upload.erase_cmd=
dstike.menu.wipe.sdk=Sketch + WiFi Settings
dstike.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
dstike.menu.wipe.all=All Flash Contents
dstike.menu.wipe.all.upload.erase_cmd=erase_flash
dstike.menu.baud.115200=115200
dstike.menu.baud.115200.upload.speed=115200
dstike.menu.baud.57600=57600
dstike.menu.baud.57600.upload.speed=57600
dstike.menu.baud.230400.linux=230400
dstike.menu.baud.230400.macosx=230400
dstike.menu.baud.230400.upload.speed=230400
dstike.menu.baud.256000.windows=256000
dstike.menu.baud.256000.upload.speed=256000
dstike.menu.baud.460800.linux=460800
dstike.menu.baud.460800.macosx=460800
dstike.menu.baud.460800.upload.speed=460800
dstike.menu.baud.512000.windows=512000
dstike.menu.baud.512000.upload.speed=512000
dstike.menu.baud.921600=921600
dstike.menu.baud.921600.upload.speed=921600
dstike.menu.baud.3000000=3000000
dstike.menu.baud.3000000.upload.speed=3000000

