R3dLion/arduino-esp8266/boards.txt
##############################################################
huzzah.name=Adafruit Feather HUZZAH
huzzah.build.board=ESP8266_ESP12
huzzah.build.variant=adafruit
huzzah.upload.tool=esptool
huzzah.upload.maximum_data_size=81920
huzzah.upload.wait_for_upload_port=true
huzzah.upload.erase_cmd=
huzzah.serial.disableDTR=true
huzzah.serial.disableRTS=true
huzzah.build.mcu=esp8266
huzzah.build.core=esp8266
huzzah.build.spiffs_pagesize=256
huzzah.build.debug_port=
huzzah.build.debug_level=
huzzah.menu.debug.disabled=Disabled
huzzah.menu.debug.serial=Serial (115200, newline)
huzzah.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200
huzzah.menu.protocol.i2c=I2C
huzzah.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C -DI2C_SDA=4 -DI2C_SCL=5
huzzah.menu.protocol.serial=Serial
huzzah.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL
huzzah.upload.resetmethod=--before default_reset --after hard_reset
huzzah.build.flash_mode=qio
huzzah.build.flash_flags=-DFLASHMODE_QIO
huzzah.build.flash_freq=40
huzzah.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
huzzah.menu.eesz.4M2M.build.flash_size=4M
huzzah.menu.eesz.4M2M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
huzzah.menu.eesz.4M2M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M2M.upload.maximum_size=1044464
huzzah.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
huzzah.menu.eesz.4M2M.build.spiffs_start=0x200000
huzzah.menu.eesz.4M2M.build.spiffs_end=0x3FA000
huzzah.menu.eesz.4M2M.build.spiffs_blocksize=8192
huzzah.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
huzzah.menu.eesz.4M3M.build.flash_size=4M
huzzah.menu.eesz.4M3M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
huzzah.menu.eesz.4M3M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M3M.upload.maximum_size=1044464
huzzah.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
huzzah.menu.eesz.4M3M.build.spiffs_start=0x100000
huzzah.menu.eesz.4M3M.build.spiffs_end=0x3FA000
huzzah.menu.eesz.4M3M.build.spiffs_blocksize=8192
huzzah.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
huzzah.menu.eesz.4M1M.build.flash_size=4M
huzzah.menu.eesz.4M1M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
huzzah.menu.eesz.4M1M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M1M.upload.maximum_size=1044464
huzzah.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
huzzah.menu.eesz.4M1M.build.spiffs_start=0x300000
huzzah.menu.eesz.4M1M.build.spiffs_end=0x3FA000
huzzah.menu.eesz.4M1M.build.spiffs_blocksize=8192
huzzah.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
huzzah.menu.eesz.4M.build.flash_size=4M
huzzah.menu.eesz.4M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
huzzah.menu.eesz.4M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M.upload.maximum_size=1044464
huzzah.menu.eesz.4M.build.rfcal_addr=0x3FC000
huzzah.build.f_cpu=160000000L
huzzah.build.vtable_flags=-DVTABLES_IN_FLASH
huzzah.build.exception_flags=-fno-exceptions
huzzah.build.sslflags=
huzzah.build.debug_port=
huzzah.build.lwip_include=lwip2/include
huzzah.build.lwip_lib=-llwip2-536-feat
huzzah.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
huzzah.menu.wipe.none=Only Sketch
huzzah.menu.wipe.none.upload.erase_cmd=
huzzah.menu.wipe.sdk=Sketch + WiFi Settings
huzzah.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
huzzah.menu.wipe.all=All Flash Contents
huzzah.menu.wipe.all.upload.erase_cmd=erase_flash
huzzah.menu.baud.115200=115200
huzzah.menu.baud.115200.upload.speed=115200
huzzah.menu.baud.57600=57600
huzzah.menu.baud.57600.upload.speed=57600
huzzah.menu.baud.230400.linux=230400
huzzah.menu.baud.230400.macosx=230400
huzzah.menu.baud.230400.upload.speed=230400
huzzah.menu.baud.256000.windows=256000
huzzah.menu.baud.256000.upload.speed=256000
huzzah.menu.baud.460800.linux=460800
huzzah.menu.baud.460800.macosx=460800
huzzah.menu.baud.460800.upload.speed=460800
huzzah.menu.baud.512000.windows=512000
huzzah.menu.baud.512000.upload.speed=512000
huzzah.menu.baud.921600=921600
huzzah.menu.baud.921600.upload.speed=921600
huzzah.menu.baud.3000000=3000000
huzzah.menu.baud.3000000.upload.speed=3000000

##############################################################
nodemcuv2.name=NodeMCU
nodemcuv2.build.board=ESP8266_NODEMCU
nodemcuv2.build.variant=nodemcu
nodemcuv2.upload.tool=esptool
nodemcuv2.upload.maximum_data_size=81920
nodemcuv2.upload.wait_for_upload_port=true
nodemcuv2.upload.erase_cmd=
nodemcuv2.serial.disableDTR=true
nodemcuv2.serial.disableRTS=true
nodemcuv2.build.mcu=esp8266
nodemcuv2.build.core=esp8266
nodemcuv2.build.spiffs_pagesize=256
nodemcuv2.build.debug_port=
nodemcuv2.build.debug_level=
nodemcuv2.menu.debug.disabled=Disabled
nodemcuv2.menu.debug.serial=Serial (115200, newline)
nodemcuv2.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200
nodemcuv2.menu.protocol.i2c=I2C
nodemcuv2.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C -DI2C_SDA=4 -DI2C_SCL=5
nodemcuv2.menu.protocol.serial=Serial
nodemcuv2.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL
nodemcuv2.upload.resetmethod=--before default_reset --after hard_reset
nodemcuv2.build.flash_mode=dio
nodemcuv2.build.flash_flags=-DFLASHMODE_DIO
nodemcuv2.build.flash_freq=40
nodemcuv2.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
nodemcuv2.menu.eesz.4M2M.build.flash_size=4M
nodemcuv2.menu.eesz.4M2M.build.flash_size_bytes=0x400000
nodemcuv2.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
nodemcuv2.menu.eesz.4M2M.build.spiffs_pagesize=256
nodemcuv2.menu.eesz.4M2M.upload.maximum_size=1044464
nodemcuv2.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
nodemcuv2.menu.eesz.4M2M.build.spiffs_start=0x200000
nodemcuv2.menu.eesz.4M2M.build.spiffs_end=0x3FA000
nodemcuv2.menu.eesz.4M2M.build.spiffs_blocksize=8192
nodemcuv2.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
nodemcuv2.menu.eesz.4M3M.build.flash_size=4M
nodemcuv2.menu.eesz.4M3M.build.flash_size_bytes=0x400000
nodemcuv2.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
nodemcuv2.menu.eesz.4M3M.build.spiffs_pagesize=256
nodemcuv2.menu.eesz.4M3M.upload.maximum_size=1044464
nodemcuv2.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
nodemcuv2.menu.eesz.4M3M.build.spiffs_start=0x100000
nodemcuv2.menu.eesz.4M3M.build.spiffs_end=0x3FA000
nodemcuv2.menu.eesz.4M3M.build.spiffs_blocksize=8192
nodemcuv2.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
nodemcuv2.menu.eesz.4M1M.build.flash_size=4M
nodemcuv2.menu.eesz.4M1M.build.flash_size_bytes=0x400000
nodemcuv2.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
nodemcuv2.menu.eesz.4M1M.build.spiffs_pagesize=256
nodemcuv2.menu.eesz.4M1M.upload.maximum_size=1044464
nodemcuv2.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
nodemcuv2.menu.eesz.4M1M.build.spiffs_start=0x300000
nodemcuv2.menu.eesz.4M1M.build.spiffs_end=0x3FA000
nodemcuv2.menu.eesz.4M1M.build.spiffs_blocksize=8192
nodemcuv2.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
nodemcuv2.menu.eesz.4M.build.flash_size=4M
nodemcuv2.menu.eesz.4M.build.flash_size_bytes=0x400000
nodemcuv2.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
nodemcuv2.menu.eesz.4M.build.spiffs_pagesize=256
nodemcuv2.menu.eesz.4M.upload.maximum_size=1044464
nodemcuv2.menu.eesz.4M.build.rfcal_addr=0x3FC000
nodemcuv2.build.f_cpu=160000000L
nodemcuv2.build.vtable_flags=-DVTABLES_IN_FLASH
nodemcuv2.build.exception_flags=-fno-exceptions
nodemcuv2.build.sslflags=
nodemcuv2.build.debug_port=
nodemcuv2.build.lwip_include=lwip2/include
nodemcuv2.build.lwip_lib=-llwip2-536-feat
nodemcuv2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
nodemcuv2.menu.wipe.none=Only Sketch
nodemcuv2.menu.wipe.none.upload.erase_cmd=
nodemcuv2.menu.wipe.sdk=Sketch + WiFi Settings
nodemcuv2.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
nodemcuv2.menu.wipe.all=All Flash Contents
nodemcuv2.menu.wipe.all.upload.erase_cmd=erase_flash
nodemcuv2.menu.baud.115200=115200
nodemcuv2.menu.baud.115200.upload.speed=115200
nodemcuv2.menu.baud.57600=57600
nodemcuv2.menu.baud.57600.upload.speed=57600
nodemcuv2.menu.baud.230400.linux=230400
nodemcuv2.menu.baud.230400.macosx=230400
nodemcuv2.menu.baud.230400.upload.speed=230400
nodemcuv2.menu.baud.256000.windows=256000
nodemcuv2.menu.baud.256000.upload.speed=256000
nodemcuv2.menu.baud.460800.linux=460800
nodemcuv2.menu.baud.460800.macosx=460800
nodemcuv2.menu.baud.460800.upload.speed=460800
nodemcuv2.menu.baud.512000.windows=512000
nodemcuv2.menu.baud.512000.upload.speed=512000
nodemcuv2.menu.baud.921600=921600
nodemcuv2.menu.baud.921600.upload.speed=921600
nodemcuv2.menu.baud.3000000=3000000
nodemcuv2.menu.baud.3000000.upload.speed=3000000

