R3dLion/arduino-esp8266/boards.txt
##############################################################
d1_mini.name=LOLIN(WEMOS) D1 mini
d1_mini.build.board=ESP8266_WEMOS_D1MINI
d1_mini.build.variant=d1_mini
d1_mini.upload.tool=esptool
d1_mini.upload.maximum_data_size=81920
d1_mini.upload.wait_for_upload_port=true
d1_mini.upload.erase_cmd=
d1_mini.serial.disableDTR=true
d1_mini.serial.disableRTS=true
d1_mini.build.mcu=esp8266
d1_mini.build.core=esp8266
d1_mini.build.spiffs_pagesize=256
d1_mini.build.debug_port=
d1_mini.build.debug_level=
d1_mini.menu.debug.disabled=Disabled
d1_mini.menu.debug.serial=Serial (115200, newline)
d1_mini.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200
d1_mini.menu.protocol.i2c=I2C
d1_mini.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C -DI2C_SDA=4 -DI2C_SCL=5
d1_mini.menu.protocol.serial=Serial
d1_mini.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL
d1_mini.upload.resetmethod=--before default_reset --after hard_reset
d1_mini.build.flash_mode=dio
d1_mini.build.flash_flags=-DFLASHMODE_DIO
d1_mini.build.flash_freq=40
d1_mini.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
d1_mini.menu.eesz.1M64.build.flash_size=1M
d1_mini.menu.eesz.1M64.build.flash_size_bytes=0x100000
d1_mini.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
d1_mini.menu.eesz.1M64.build.spiffs_pagesize=256
d1_mini.menu.eesz.1M64.upload.maximum_size=958448
d1_mini.menu.eesz.1M64.build.rfcal_addr=0xFC000
d1_mini.menu.eesz.1M64.build.spiffs_start=0xEB000
d1_mini.menu.eesz.1M64.build.spiffs_end=0xFB000
d1_mini.menu.eesz.1M64.build.spiffs_blocksize=4096
d1_mini.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
d1_mini.menu.eesz.1M128.build.flash_size=1M
d1_mini.menu.eesz.1M128.build.flash_size_bytes=0x100000
d1_mini.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
d1_mini.menu.eesz.1M128.build.spiffs_pagesize=256
d1_mini.menu.eesz.1M128.upload.maximum_size=892912
d1_mini.menu.eesz.1M128.build.rfcal_addr=0xFC000
d1_mini.menu.eesz.1M128.build.spiffs_start=0xDB000
d1_mini.menu.eesz.1M128.build.spiffs_end=0xFB000
d1_mini.menu.eesz.1M128.build.spiffs_blocksize=4096
d1_mini.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
d1_mini.menu.eesz.1M144.build.flash_size=1M
d1_mini.menu.eesz.1M144.build.flash_size_bytes=0x100000
d1_mini.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
d1_mini.menu.eesz.1M144.build.spiffs_pagesize=256
d1_mini.menu.eesz.1M144.upload.maximum_size=876528
d1_mini.menu.eesz.1M144.build.rfcal_addr=0xFC000
d1_mini.menu.eesz.1M144.build.spiffs_start=0xD7000
d1_mini.menu.eesz.1M144.build.spiffs_end=0xFB000
d1_mini.menu.eesz.1M144.build.spiffs_blocksize=4096
d1_mini.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
d1_mini.menu.eesz.1M160.build.flash_size=1M
d1_mini.menu.eesz.1M160.build.flash_size_bytes=0x100000
d1_mini.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
d1_mini.menu.eesz.1M160.build.spiffs_pagesize=256
d1_mini.menu.eesz.1M160.upload.maximum_size=860144
d1_mini.menu.eesz.1M160.build.rfcal_addr=0xFC000
d1_mini.menu.eesz.1M160.build.spiffs_start=0xD3000
d1_mini.menu.eesz.1M160.build.spiffs_end=0xFB000
d1_mini.menu.eesz.1M160.build.spiffs_blocksize=4096
d1_mini.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
d1_mini.menu.eesz.1M192.build.flash_size=1M
d1_mini.menu.eesz.1M192.build.flash_size_bytes=0x100000
d1_mini.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
d1_mini.menu.eesz.1M192.build.spiffs_pagesize=256
d1_mini.menu.eesz.1M192.upload.maximum_size=827376
d1_mini.menu.eesz.1M192.build.rfcal_addr=0xFC000
d1_mini.menu.eesz.1M192.build.spiffs_start=0xCB000
d1_mini.menu.eesz.1M192.build.spiffs_end=0xFB000
d1_mini.menu.eesz.1M192.build.spiffs_blocksize=4096
d1_mini.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
d1_mini.menu.eesz.1M256.build.flash_size=1M
d1_mini.menu.eesz.1M256.build.flash_size_bytes=0x100000
d1_mini.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
d1_mini.menu.eesz.1M256.build.spiffs_pagesize=256
d1_mini.menu.eesz.1M256.upload.maximum_size=761840
d1_mini.menu.eesz.1M256.build.rfcal_addr=0xFC000
d1_mini.menu.eesz.1M256.build.spiffs_start=0xBB000
d1_mini.menu.eesz.1M256.build.spiffs_end=0xFB000
d1_mini.menu.eesz.1M256.build.spiffs_blocksize=4096
d1_mini.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
d1_mini.menu.eesz.1M512.build.flash_size=1M
d1_mini.menu.eesz.1M512.build.flash_size_bytes=0x100000
d1_mini.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
d1_mini.menu.eesz.1M512.build.spiffs_pagesize=256
d1_mini.menu.eesz.1M512.upload.maximum_size=499696
d1_mini.menu.eesz.1M512.build.rfcal_addr=0xFC000
d1_mini.menu.eesz.1M512.build.spiffs_start=0x7B000
d1_mini.menu.eesz.1M512.build.spiffs_end=0xFB000
d1_mini.menu.eesz.1M512.build.spiffs_blocksize=8192
d1_mini.menu.eesz.1M=1MB (FS:none OTA:~502KB)
d1_mini.menu.eesz.1M.build.flash_size=1M
d1_mini.menu.eesz.1M.build.flash_size_bytes=0x100000
d1_mini.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
d1_mini.menu.eesz.1M.build.spiffs_pagesize=256
d1_mini.menu.eesz.1M.upload.maximum_size=1023984
d1_mini.menu.eesz.1M.build.rfcal_addr=0xFC000
d1_mini.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
d1_mini.menu.eesz.4M2M.build.flash_size=4M
d1_mini.menu.eesz.4M2M.build.flash_size_bytes=0x400000
d1_mini.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
d1_mini.menu.eesz.4M2M.build.spiffs_pagesize=256
d1_mini.menu.eesz.4M2M.upload.maximum_size=1044464
d1_mini.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
d1_mini.menu.eesz.4M2M.build.spiffs_start=0x200000
d1_mini.menu.eesz.4M2M.build.spiffs_end=0x3FA000
d1_mini.menu.eesz.4M2M.build.spiffs_blocksize=8192
d1_mini.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
d1_mini.menu.eesz.4M3M.build.flash_size=4M
d1_mini.menu.eesz.4M3M.build.flash_size_bytes=0x400000
d1_mini.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
d1_mini.menu.eesz.4M3M.build.spiffs_pagesize=256
d1_mini.menu.eesz.4M3M.upload.maximum_size=1044464
d1_mini.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
d1_mini.menu.eesz.4M3M.build.spiffs_start=0x100000
d1_mini.menu.eesz.4M3M.build.spiffs_end=0x3FA000
d1_mini.menu.eesz.4M3M.build.spiffs_blocksize=8192
d1_mini.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
d1_mini.menu.eesz.4M1M.build.flash_size=4M
d1_mini.menu.eesz.4M1M.build.flash_size_bytes=0x400000
d1_mini.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
d1_mini.menu.eesz.4M1M.build.spiffs_pagesize=256
d1_mini.menu.eesz.4M1M.upload.maximum_size=1044464
d1_mini.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
d1_mini.menu.eesz.4M1M.build.spiffs_start=0x300000
d1_mini.menu.eesz.4M1M.build.spiffs_end=0x3FA000
d1_mini.menu.eesz.4M1M.build.spiffs_blocksize=8192
d1_mini.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
d1_mini.menu.eesz.4M.build.flash_size=4M
d1_mini.menu.eesz.4M.build.flash_size_bytes=0x400000
d1_mini.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
d1_mini.menu.eesz.4M.build.spiffs_pagesize=256
d1_mini.menu.eesz.4M.upload.maximum_size=1044464
d1_mini.menu.eesz.4M.build.rfcal_addr=0x3FC000
d1_mini.menu.eesz.16M14M=16MB (FS:14MB OTA:~1019KB)
d1_mini.menu.eesz.16M14M.build.flash_size=16M
d1_mini.menu.eesz.16M14M.build.flash_size_bytes=0x1000000
d1_mini.menu.eesz.16M14M.build.flash_ld=eagle.flash.16m14m.ld
d1_mini.menu.eesz.16M14M.build.spiffs_pagesize=256
d1_mini.menu.eesz.16M14M.upload.maximum_size=1044464
d1_mini.menu.eesz.16M14M.build.rfcal_addr=0xFFC000
d1_mini.menu.eesz.16M14M.build.spiffs_start=0x200000
d1_mini.menu.eesz.16M14M.build.spiffs_end=0xFFA000
d1_mini.menu.eesz.16M14M.build.spiffs_blocksize=8192
d1_mini.menu.eesz.16M15M=16MB (FS:15MB OTA:~512KB)
d1_mini.menu.eesz.16M15M.build.flash_size=16M
d1_mini.menu.eesz.16M15M.build.flash_size_bytes=0x1000000
d1_mini.menu.eesz.16M15M.build.flash_ld=eagle.flash.16m15m.ld
d1_mini.menu.eesz.16M15M.build.spiffs_pagesize=256
d1_mini.menu.eesz.16M15M.upload.maximum_size=1044464
d1_mini.menu.eesz.16M15M.build.rfcal_addr=0xFFC000
d1_mini.menu.eesz.16M15M.build.spiffs_start=0x100000
d1_mini.menu.eesz.16M15M.build.spiffs_end=0xFFA000
d1_mini.menu.eesz.16M15M.build.spiffs_blocksize=8192
d1_mini.build.f_cpu=160000000L
d1_mini.build.vtable_flags=-DVTABLES_IN_FLASH
d1_mini.build.exception_flags=-fno-exceptions
d1_mini.build.sslflags=
d1_mini.build.debug_port=
d1_mini.build.lwip_include=lwip2/include
d1_mini.build.lwip_lib=-llwip2-536-feat
d1_mini.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
d1_mini.menu.wipe.none=Only Sketch
d1_mini.menu.wipe.none.upload.erase_cmd=
d1_mini.menu.wipe.sdk=Sketch + WiFi Settings
d1_mini.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
d1_mini.menu.wipe.all=All Flash Contents
d1_mini.menu.wipe.all.upload.erase_cmd=erase_flash
d1_mini.menu.baud.921600=921600
d1_mini.menu.baud.921600.upload.speed=921600
d1_mini.menu.baud.57600=57600
d1_mini.menu.baud.57600.upload.speed=57600
d1_mini.menu.baud.115200=115200
d1_mini.menu.baud.115200.upload.speed=115200
d1_mini.menu.baud.230400.linux=230400
d1_mini.menu.baud.230400.macosx=230400
d1_mini.menu.baud.230400.upload.speed=230400
d1_mini.menu.baud.256000.windows=256000
d1_mini.menu.baud.256000.upload.speed=256000
d1_mini.menu.baud.460800.linux=460800
d1_mini.menu.baud.460800.macosx=460800
d1_mini.menu.baud.460800.upload.speed=460800
d1_mini.menu.baud.512000.windows=512000
d1_mini.menu.baud.512000.upload.speed=512000
d1_mini.menu.baud.3000000=3000000
d1_mini.menu.baud.3000000.upload.speed=3000000

